#HW1  -4-7. 조합론프로그래밍과제-
# 과제1:52장의카드에서만들수있는페어가정확히하나만있는5장조합을모두출력하는프로그램을작성하라.
# 출력이너무많으면카드수를줄일수있다



#x+y+z=100의자연수해를모두출력하는프로그램을작성하라

x = 1
y = 1
z = 98
while y<99 :
    while x<99 and z>0 :
        print("{0},{1},{2}".format(x, y, z))
        x+=1
        z = 100 - x - y

    x=1
    y += 1
    z = 100 - x - y


#과제3: m개의원소를가진집합에서n개의원소를가진집합으로가는전사함수의개수를출력하는프로그램을작성하라.
# m과n의값을바꾸어보면서값이너무커지지않는입력의범위가어느정도인지확인해보라
m= int(input("m값을 입력하세요:"))
n= int(input("n값을 입력하세요:"))
result= n**m
print("%d" % result)

# 과제 4 : m개의원소를가진집합에서 n개의원소를가진집합으로가는 전사함수를 모두출력하는프로그램을작성하라.
# 출력을어떻게하는것이적절할지생각해보아야한다
m= int(input("m값을 입력하세요:"))
n= int(input("n값을 입력하세요:"))
x = list(range(m))
y = list(range(n))
i= 0
j= 0
while i<m:
    while j<n:
        print("%d , %d " % (x[i], y[j]))
        j +=1
    j=0
    i+=1
